Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: They are discussed further in “Declaring Keyed State at RuntimeCon‐ text” on page 154.
zh_cn: 更多相关内容请见154页"在RuntimeContext中声明键值分区状态"。

source: They are related to record timestamps.
zh_cn: 和记录的时间戳存在联系。

source: They can also modify the structure of the dataflow graph by either splitting a stream into multi‐ ple streams or merging streams into a single flow.
zh_cn: 也可以通过单流分割或合并多条流来改变dataflow图的结构。

source: They can only be applied if the window collects all added events and does not
zh_cn: 该操作的应用前提是窗口能够取得全部已加入的事件，

source: They communicate via event logs instead of REST calls and hold application data as local state instead of writing it to and reading it from an external data store, such as a transactional database or key-value store.
zh_cn: 微服务通过REST调用进行通信，利用关系型数据库或键值存储等外部系统存储数据；而事件驱动型应用利用事件日志进行通信，而其数据会以本地状态形式存储。

source: They communicate via event logs instead of REST calls and hold application data as local state instead of writing it to and reading it from an external datastore, such as a relational database or key-value store.
zh_cn: 微服务通过REST调用进行通信，利用事务型数据库或键值存储等外部系统存储数据；而事件驱动型应用利用事件日志进行通信，其数据则会以本地状态形式存储。

source: They consume data from inputs, perform a computation on them, and produce data to outputs for further processing.
zh_cn: 它们从输入获取数据，对其进行计算，然后产生数据并发往输出以供后续处理。

source: They control how long to wait for data to arrive before performing a computation, such as finalizing a window computation and emitting the result.
zh_cn: 它们控制着在执行某些计算（例如完成窗口计算并发出结果）前需要等待数据到达的时间。

source: They enable transfor‐ mations such as aggregations on bounded intervals of an unbounded stream.
zh_cn: 它们可以在无限数据流上基于有界区间实现聚合等转换。

source: They follow the UNIX philoso‐ phy of doing a single thing and doing it well.
zh_cn: 每个应用都遵循UNIX设计哲学：专注做好一件事。

source: They follow the UNIX philosophy of doing a single thing and doing it well.
zh_cn: 每个应用都遵循UNIX设计哲学：专注做好一件事。

source: They must be monotonically increasing to ensure the event-time clocks of tasks are progressing and not going backward.
zh_cn: 必须单调递增。这是为了确保任务中的事件时间时钟正确前进，不会倒退。

source: They need to be serialized and deserialized to ship them over the network or write them into or read them from state backends, checkpoints, and savepoints.
zh_cn: 出于网络传输，读写状态、检查点和保存点等目的，需要对它们进行序列化和反序列化。

source: They use a state backend–specific storage format and do not support rescaling.
zh_cn: 它们会使用特定于某个状态后端的存储格式，且不支持扩缩容。

source: Think of user interac‐ tions on websites or in mobile apps, placements of orders, server logs, or sensor measurements; all of these data are streams of events.
zh_cn: 考虑一下，无论是网站或移动应用中的用户交互还是订单下达，无论是服务器日志还是传感器测量结果，这些数据本质上都是事件流。

source: Think of user interac‐ tions on websites or in mobile apps, placements of orders, server logs, or sensor measurements; all of these are streams of events.
zh_cn: 请考虑一下，无论是网站或移动应用中的用户交互或订单下达，还是服务器日志或传感器测量结果，这些数据本质上都是事件流。

source: Third, the Lambda architecture is hard to setup and maintain.
zh_cn: 最后，Lambda架构很难配置和维护，

source: Third, the lambda architecture is hard to set up and maintain.
zh_cn: 最后，Lambda架构很难配置和维护。

source: This allows you to easily scale the application by adjusting its parallelism via the submission client.
zh_cn: 这样就可以通过提交客户端来轻易调整并行度，从而实现应用的扩缩容。

source: This allows you to implement operators that are dynam‐ ically configured via a data stream (e.g., to add or remove filtering rules or update machine-learning models).
zh_cn: 你可以利用广播状态实现一个通过数据流进行动态配置的算子（例如：添加、删除规则或者更新机器学习模型）。

source: This allows you to migrate an application to a newer Flink version or to a different cluster or data- center.
zh_cn: 这允许你把应用迁移到一个新的Flink版本，或是一个不同的集群或数据中心。

source: This also means the effective checkpointing interval is at least 30 seconds and there is at most one checkpoint happening at the same time.
zh_cn: 而这也意味着有效检查点生成间隔至少要为30秒，且同时最多只可以生成一个检查点。

source: This application design can cause problems when applications need to evolve or scale.
zh_cn: 该设计在应用需要更新或扩缩容时，容易导致问题。

source: This approach is useful if none of the provided builds work for your setup.
zh_cn: 本方法适用于上面所提供的构建方式都无法满足你所需设置的情况。

source: This aspect depends on the APIs of the stream processor, what kinds of state primitives it provides, and on the quality of its support for event-time processing.
zh_cn: 具体一些，这种能力依赖于流处理引擎的API、提供的状态原语以及对事件时间处理的支持程度。

source: This aspect depends on the APIs of the stream processor, what kinds of state primitives it provides, and the quality of its support for event-time processing.
zh_cn: 这方面要取决于流处理引擎的API、提供的状态原语以及对事件时间处理的支持程度。

source: This behavior can cause problems if the event times of the individual input streams of an application are not aligned.
zh_cn: 如果不同输入流的事件时间没有对齐，那么该行为就会导致一些问题。

source: This behavior guarantees end-to-end exactly-once because in case of a failure, the application is reset to the last checkpoint and no results have been emitted to the sink system after that checkpoint.
zh_cn: 该行为可以提供端到端的精确一次保障，因为在发生故障后，应用会被重置到上一个检查点，而接收系统不会收到任何在该检查点之后生成的结果。

source: This behavior yields nondeterministic results and is usually
zh_cn: 该行为会产生不确定的结果，而这往往并不是我们希望看到的。

source: This book couldn’t have been possible without the help and support of several amaz‐ ing people.
zh_cn: 本书的付梓离不开众多能人志士的帮助和支持，

source: This book covers the DataStream API and ProcessFunctions which provide primitives for common stream processing operations, such as windowing and asynchronous operations, and interfaces to precisely control state and time.
zh_cn: 本书涵盖了DataStream API和ProcessFunction的相关内容，它们提供了通用的流处理操作原语（如：窗口划分、异步操作）以及精确控制时间和状态的接口。

source: This book covers the DataStream API and process functions, which provide primitives for common stream processing operations, such as windowing and asynchronous operations, and interfaces to precisely control state and time.
zh_cn: 本书涵盖了DataStream API和处理函数（process function）的相关内容，它们提供了通用的流处理操作原语（如窗口划分和异步操作）以及精确控制时间和状态的接口。

source: This book summarizes knowledge obtained through years of design, development, and testing performed by the Apache Flink community at large.
zh_cn: 书中总结了Apache Flink社区多年来在设计、开发、测试等方面积累的知识。

source: This book will teach you everything to know about stream processing with Apache Flink.
zh_cn: 本书将教给你用Apache Flink进行流处理的一切知识。

source: This book will teach you everything you need to know about stream processing with Apache Flink.
zh_cn: 本书将教给你基于Apache Flink进行流处理的一切知识。

source: This can be a single topic, a list of topics, or a regular expression that matches all topics to read from.
zh_cn: 它可以是单个主题，一个主题列表或是某个匹配所有目标主题的正则表达式。

source: This can be done by registering timers for a point of time in the future.4 Similar to state, timers are registered in the context of the currently active key.
zh_cn: 该工作可以通过注册针对未来某个时间点的计时器来完成。4 和状态类似，计时器也会注册在当前活动键值的上下文中。

source: This can be easily handled by including the <job_id>.
zh_cn: 为此你可以将<job_id>加入到标识中。

source: This can be ensured by running one or more standby workers.
zh_cn: 我们可以通过运行一个或多个后备工作进程来对此进行保障。

source: This can be explained by looking at the steps of a naive algorithm that takes a consistent checkpoint of an application.
zh_cn: 我们可以通过一个朴素算法对应用建立一致性检查点的步骤进行解释。

source: This can be very problematic, because it may prevent the whole application from advancing its watermarks and hence lead to a stalling application.
zh_cn: 该行为可能会导致严重问题，因为它有可能会阻碍全局水位线的前进，继而导致应用停止工作。

source: This case is shown in Figure 6-4.
zh_cn: 该情况如图6-4所示。

source: This chapter focuses on the implementation of stateful user-defined functions and discusses the performance and robustness of stateful applications.
zh_cn: 本章重点介绍如何实现状态化用户自定义函数，并讨论状态化应用的性能及健壮性。

source: This chapter introduces the basics of Flink’s DataStream API.
zh_cn: 本章主要介绍Flink DataStream API的基础知识。

source: This chapter is still rather independent of Flink.
zh_cn: 本章节内容仍然独立于Flink。

source: This chapter provides relevant background information to successfully implement and operate advanced streaming applications with Apache Flink.
zh_cn: 本章会涉及使用Apache Flink实现并操纵高级流式应用的相关背景。

source: This check is necessary to ensure event time continuously increases; otherwise no watermark is produced.
zh_cn: 这项检查对于保证事件时间持续递增十分必要，一旦检查失败将不会生成水位线。

source: This checkpointing and recovery mechanism can provide exactly-once consistency for application state, given that all operators checkpoint and restore all of their states
zh_cn: 如果所有算子都将它们全部的状态写入检查点并从中恢复，并且所有输入流的消费位置都能重置到检查点生成那一刻，那么该检查点和恢复机制就能为整个应用的状态提供精确一次的一致性保障。

source: This class is provided by the flink- queryable-state-client-java dependency, which you can add to your project as
zh_cn: 这个类由flink-queryable-state-client-java依赖提供，你可以像下面这样把它添加到你的项目里：

source: This command submits the application to the master that runs on host myMasterHost
zh_cn: 上述命令会将应用提交到myMasterHost主机、9876端口上的主进程。

source: This conversion is based on the data
zh_cn: 其装换过程基于状态的数据类型。

source: This deployment mode is common for microservice architectures.
zh_cn: 该部署模式常用于微服务架构。

source: This deployment mode is common for microservices architectures.
zh_cn: 后者常用于微服务架构。

source: This deployment specifies that a single master container should be run (replicas: 1).
zh_cn: 这个Deployment指定了我们需要运行一个主进程容器（replicas: 1）。

source: This design can cause problems when applications need to evolve or scale.
zh_cn: 该设计模式在应用需要升级或扩容时，容易导致问题。

source: This differs from batch processing where user-defined functions, such as GroupReduceFunction, are called when all data to be processed has been collected.
zh_cn: 这和批处理情况不同。在批处理中，只有在全部所需处理的数据都收集完后才会调用用户自定义函数（如GroupReduceFunction）。

source: This ensures first that the state is saved and persistent and second that it
zh_cn: 这不但可以确保状态存储的持久化，

source: This example shows a flatMap transformation commonly found in data processing tutorials.
zh_cn: 下方例子展示了数据处理教程中一个常见的flagMap转换。

source: This fea‐ ture comes in handy when developing and testing Flink applications.
zh_cn: 这在开发和调试Flink应用的时候非常好用。

source: This feature comes in handy when developing and testing Flink appli‐ cations.
zh_cn: 这在开发和调试Flink应用的时候非常好用。

source: This function will be discussed in “Assigning Timestamps and Generating Watermarks” on page 111.
zh_cn: 这个函数会在111页"分配时间戳和生成水位线"中介绍。

source: This gives the possibility to release cluster resources for higher-priority applications or when input data is not continuously produced.
zh_cn: 这样可以为更高优先级的应用腾出集群资源，或者在输入数据不连续的情况下及时释放资源。

source: This includes adding of stateful or stateless operators to the application.
zh_cn: 包括向应用中添加状态化或非状态化算子。

source: This includes handling of very large states, possibly exceeding memory, and ensuring that no state is lost in case of failures.
zh_cn: 这其中包括如何处理数量巨大、可能超出内存的状态，如何保证发生故障时状态不会丢失。

source: This includes modifica‐ tions due to appending writes.
zh_cn: 此处的改动包括由追加写所引起的。

source: This includes window operators and time-based joins as well as process functions that provide the most flexibility when dealing with time in streaming applications.
zh_cn: 其中包含窗口算子、基于时间的Join以及一系列处理函数，它们让流式应用中的时间处理变得十分灵活。

source: This information is requested from the Job‐ Manager that manages the key group assignment, and is cached once received.6 The client proxy retrieves the state from the state server of the respective Task‐ Manager and serves the result to the client.
zh_cn: 该信息可以从负责键值组分配的JobManager上面获得，代理在一次请求过后就会将它们缓存下来。6 客户端代理从各自TaskManager的状态服务器上取得状态，然后把结果返给客户端。

source: This information needs to be recovered in case of a master failure.
zh_cn: 这些信息都需要在主进程发生故障时进行恢复。

source: This information will come in handy when designing advanced stream‐ ing applications, setting up and configuring clusters, and operating streaming appli‐ cations as well as reasoning about their performance.
zh_cn: 在设计高级流式应用，搭建和配置集群以及操纵流式应用并推断其性能时，这些内容都将派上用场。

source: This interface provides the notifyCheckpointComplete(long chkpntId) method, which might be called when the JobManager registers a checkpoint as completed—when all operators successfully
zh_cn: 该接口提供的notifyCheckpointComplete(long chkpntId)方法，会在JobManager将检查点注册为已完成时（即所有算子都成功将其状态复制到远程存储后）被调用。

source: This is a common strat‐ egy to produce (incomplete) low-latency results despite using a conservative water‐ marking strategy.
zh_cn: 这是一个在保守的水位线策略下依然可以产生（非完整的）低延迟结果的常用方法。

source: This is also the case if the unique identifier of an operator or the name of a state was changed.
zh_cn: 如果算子的唯一标识或状态名称发生了改变，也会出现这种情况。

source: This is also the reason it is not a good idea to override existing timestamps and watermarks in the middle of a streaming application, although this is possible with user-defined functions.
zh_cn: 这也是为什么不建议在流式应用中途覆盖已有的时间戳和水位线（虽然这可以通过用户自定义函数实现）。

source: This is also true for processing-time timers that are persisted in a savepoint.
zh_cn: 存入保存点中的处理时间计时器也是如此。

source: This is batch processing regardless of whether the architecture is based on a data warehouse or components of the Hadoop ecosystem.
zh_cn: 无论它们的架构是基于数据仓库还是Hadoop生态系统组件，这都属于批处理。

source: This is done by closing the current in- progress file and discarding the invalid part at the file’s end, for example, by using the filesystem’s truncate operation.
zh_cn: 该工作可以通过关闭当前进行写入的文件，并丢弃文件末尾的无效部分（例如通过文件系统的截断操作）来完成。

source: This is done by copying it from the ./opt folder of your installation into the ./lib folder.
zh_cn: 为此，你可以直接将JAR文件从Flink安装路径的./opt目录拷贝到./lib目录中。

source: This is done by running the following command:
zh_cn: 该工作可以通过以下命令完成：

source: This is fine for some applications, but what if you are only interested in the most recent data?
zh_cn: 该操作对某些应用而言是可行的，但如果你只对最新的那部分数据感兴趣该怎么办？

source: This is obviously a problem if pods need to communicate with each other.
zh_cn: 显然，这在Pod需要相互通信时会导致问题。

source: This is possible if the following two properties hold:
zh_cn: 该类型的连接器有以下两个实施前提：

source: This is required if multiple Flink clusters rely on the same ZooKeeper instance for failure recovery:
zh_cn: 该配置只有在多个Flink集群依赖同一个ZooKeeper实例来进行故障恢复时才是必需的：

source: This is similar to the maintenance techniques database sys‐
zh_cn: 这有点类似于数据库系统为了更新物化视图而用到的维护技术。

source: This is similar to view maintenance techniques that database systems use to update materi‐ alized views.
zh_cn: 这有点类似于数据库系统为了更新物化视图而使用的视图维护技术。

source: This is suffi‐ cient to recover from worker failures, which are handled by the ResourceManager.
zh_cn: 这足以让ResourceManager对工作进程进行故障恢复。

source: This is the default behavior.
zh_cn: 这也是默认的行为。

source: This is the default behavior: FlinkKafkaConsumer.setStartFromGroupOffsets()
zh_cn: 这也是默认的行为：FlinkKafkaConsumer.setStartFromGroupOffsets()

source: This is the default setting.
zh_cn: 这是默认设置。

source: This is the last call in our example:
zh_cn: 这是我们示例中最后一个方法调用：

source: This is the same use case as in the keyed state example before, but the KeyedProcessFunction also clears the state for keys (i.e., sensors) that have not pro‐ vided any new temperature measurements within one hour of event time.
zh_cn: 这和之前使用键值分区状态的用例相同，但此处的KeyedProcessFunction会在某一键值超过1小时（事件时间）都没有新到的温度测量数据时将其对应的状态清除。

source: This is the strictest and most challenging to achieve type of guarantee.
zh_cn: 这是最严格也是最难实现的一类保障。

source: This is useful if none of Flink’s binary distributions works with the Hadoop version deployed in your environment; for example, if you run a patched Hadoop version or a Hadoop version of a distribu‐ tor, such as Cloudera, Hortonworks, or MapR.
zh_cn: 该方法可用于你环境中的Hadoop版本和所有Flink二进制发行版都不匹配的情况。例如，你运行的是打过补丁的Hadoop版本或使用了某个发行商（如Cloudera、Hortonworks或MapR）的Hadoop版本。

source: This is very attractive especially in combination with Flink’s savepoint feature which can reset the state of an application to a previous consistent savepoint.
zh_cn: 这在Flink保存点（savepoint）功能的加持下，尤为引人注目。所谓保存点功能是指在保证一致性的前提下，允许将应用状态重置到先前某个保存的位置。

source: This is what we call the framework style of deploying applications.
zh_cn: 即我们称作框架模式的应用部署形式。

source: This is why Flink is able to support all HCFSs.
zh_cn: 这也是为何Flink可以支持任意HCFS（Hadoop Compatible File System，兼容Hadoop的文件系统）。

source: This makes development easier and sim‐ plifies cluster deployment, as you can run the exact same code in a cluster environ‐ ment without making any changes.
zh_cn: 这让开发过程变得更容易，也让集群部署更简单，因为你可以在不对代码进行任何修改的情况下直接切换到集群环境中运行。

source: This makes the JobManager a single point of failure for applications in Flink.
zh_cn: 这就导致JobManager成为Flink应用中的一个单点失效组件。

source: This makes the JobManager a single-point-of-failure for applications in Flink.
zh_cn: 这就导致JobManager成为Flink应用中一个单点失效组件。

source: This matching is done in two steps.
zh_cn: 具体匹配过程分为两步。

source: This means an application should not run close to 100% resource consumption during regular processing.
zh_cn: 这意味着应用在常规处理时不应该接近100%的资源消耗。

source: This means if the difference between an element’s event time and the maximum timestamp of all previous elements is greater than 10 seconds, the element might arrive for processing after its corresponding computation has completed and the result has been emitted.
zh_cn: 这意味着如果元素的事件时间和之前到达元素的最大时间戳相差超过10秒，那么当元素到达并开始处理时，它本应参与的计算可能已经完成并发出结果。

source: This means that all records processed by the same parallel task have access to the same state.
zh_cn: 这意味着所有在同一个并行任务之内的记录都能访问到相同的状态。

source: This means that you can‐ not easily evolve the data type of a state in your application, unless you designed your application with state evolution in mind from the start.
zh_cn: 这意味着你除非从最开始就考虑应用状态后面可能会发生变化，否则无法轻易修改应用中状态的数据类型。

source: This means that you should take application requirements and the properties of its input data, such as key domain, into account when designing and implementing stateful operators.
zh_cn: 这意味着你在设计和实现状态化算子的时候，需要把应用需求和输入数据的属性（如键值域）都考虑在内。

source: This means the time needed to prepare a single beverage will increase, causing each person to spend more time in the coffees hop, thus lowering the overall throughput.
zh_cn: 这意味着准备单杯咖啡的时间会延长，继而导致每位顾客在店里花费的时间增加，此时整体吞吐量将会下降。

source: This method can decide to gen‐ erate a new watermark or not.
zh_cn: 它可以决定是否生成一个新的水位线。

source: This method may also be called twice for a transaction.
zh_cn: 该方法可能同样会针对一个事务调用多次。

source: This method receives a Par titioner object that implements the partitioning logic and the field or key posi‐
zh_cn: 该方法接收一个Partitioner对象，你在其中可以实现分区逻辑，定义分区需要参照的字段或键值位置。

source: This method returns a local or remote environment, depending on the con‐
zh_cn: 根据调用时所处上下文的不同，该方法可能会返回一个本地或远程环境。

source: This method stores every event in a buffer until its processing has been acknowledged by all tasks in the pipeline, at which point the event can be discarded.
zh_cn: 该方法会将所有事件存在缓冲区中，直到处理管道中所有任务都确认某个事件已经处理完毕才会将事件丢弃。

source: This method uses the current timestamp to generate watermarks, since no earlier timestamps can appear.
zh_cn: 基于时间戳不会回退的事实，该方法使用当前时间戳生成水位线。

source: This mode is used to execute a Flink program within an IDE.
zh_cn: 该模式可用于在IDE中执行Flink应用。

source: This needs to be taken into
zh_cn: 你在实现接口时需要考虑到这点。

source: This operation must be idem‐ potent—records must not be written twice to the output system if this method is
zh_cn: 该操作必须是幂等的，即在多次调用的情况下它不会将记录多次写入输出系统。

source: This parameter specifies that an application is only completely canceled if it exceeds its restart attempts within the val‐ idity interval, meaning attempts that predate the interval are not taken into account.
zh_cn: 该参数指定应用只有在有效间隔内重启次数超过了最大尝试数才会被完全取消，换句话说，该时间间隔之前的尝试次数都不会被计算在内。

source: This parame‐ ter also determines the number of started worker containers.
zh_cn: 该参数还用于决定启动工作容器的数量。

source: This partitioning strategy must be used with
zh_cn: 使用此分区策略时务必小心，

source: This prevents another checkpoint from completing after the savepoint, which would trigger exactly-once sinks to emit data after the savepoint.
zh_cn: 这可以防止在生成保存点后又出现一次检查点的情况，该情况会触发精确一次数据汇在保存点后发出额外数据。

source: This problem does not only exist for custom stateful functions but also for some of the built-in operators of the DataStream API.
zh_cn: 该问题不但存在于自定义的状态化函数中，还会影响DataStream API中的部分内置算子。

source: This problem is commonly solved by delegating state management to an external system, such as a database.
zh_cn: 该问题通常的解决方案是将状态管理交由某个外部系统（如：数据库）完成。

source: This problem is commonly solved by delegating state manage‐ ment to an external system, such as a database.
zh_cn: 该问题通常的解决方案是将状态管理交由某个外部系统（如：数据库）完成。

source: This property can be leveraged during checkpoints and when rescaling an operator.
zh_cn: 这种相同的特性将有利于检查点保存或算子扩缩容，

source: This requires splitting or merging of state objects.
zh_cn: 这就需要拆分或合并状态对象。

source: This setting offers very low latency because processing tasks do not have to wait for watermarks to advance the event time.
zh_cn: 在该配置下，由于处理任务无须依靠等待水位线来驱动事件时间前进，所以可以提供极低的延迟。

source: This situation can be problematic for time-based operators that rely on an advancing clock to perform computations and clean up their state.
zh_cn: 这种情形会给那些靠时钟前进来执行计算或清除状态的时间相关算子带来麻烦。

source: This situation is commonly known as backpressure and there exist different strategies to deal with it.
zh_cn: 这种情形通常被称为背压（backpressure），可以通过多种策略来处理。

source: This situation is commonly known as backpressure and there are different strategies to deal with it.
zh_cn: 这种情形通常被称为背压（backpressure），我们有多种可选策略来处理它。

source: This special record is called a latency marker, and it bears a timestamp indicating when it was emitted.
zh_cn: 这些特殊的记录被称为延迟标记（latency marker），每个延迟标记都带有一个表明它们何时发出的时间戳。

source: This state can be updated by incoming events and can be used in the processing logic of future events.
zh_cn: 它们的状态会根据传入的事件更新，并用于未来事件的处理逻辑中。

source: This state can be upda‐ ted by incoming events and can be used in the processing logic of future events.
zh_cn: 它们的状态会根据传入的事件更新，并用于未来事件的处理逻辑中。

source: This state is completely controlled by the trigger and not maintained by the window operator.
zh_cn: 该状态并非由窗口算子进行维护，而是完全由触发器来控制。

source: This technique is fun‐ damental to effectively utilize the networking resource and achieve high throughput.
zh_cn: 该技术是有效利用网络资源、实现高吞吐的基础。

source: This technique is funda‐ mental to effectively using the networking resource and achieving high throughput.
zh_cn: 该技术是有效利用网络资源、实现高吞吐的基础。

source: This technique is used to recover from failures but can also be leveraged to update an application, fix bugs and repair previously emitted results, migrate an application to a different cluster, or perform A/B tests with different application versions.
zh_cn: 该技术不但可用于失败恢复，还可用于应用更新、bug修复、结果修正、集群迁移或针对不同版本应用执行A/B测试。

source: This type of application is called a data pipeline.
zh_cn: 我们将此类应用称为数据管道。

source: This type of guarantee is also known as “no guar‐ antee” since even a system that drops every event can provide this guarantee.
zh_cn: 这类保障也被称作"没有保障"，因为即便系统丢掉所有事件也能满足其条件。

source: This type of guarantee is also known as “no-guarantee” since even a system that drops every event can fulfil it.
zh_cn: 这类保障也被称作"没有保障"，因为即便系统丢掉所有事件也能满足。

source: This type of guarantee is called at-least-once and it means that all events will def‐ initely be processed, even though some of them might be processed more than once.
zh_cn: 这类保障称为至少一次。它意味着所有事件最终都会处理，即便有些可能会处理多次。

source: This type of guarantee is called at-least-once, and it means that all events will be pro‐
zh_cn: 这类保障称为至少一次。它意味着所有事件最终都会处理，虽然有些可能会处理多次。

source: This type of parallelism is called data parallelism.
zh_cn: 这种并行称为数据并行。

source: This type of parallelism is called task parallelism.
zh_cn: 这种并行称为任务并行。

source: This way, it can ensure that the order guarantees on each partition are leveraged and no unnecessary late records are emitted.
zh_cn: 这样的话，它就可以充分利用每个分区的保序性，避免发出不必要的迟到记录。

source: This way, open source communities are constantly improving the capabilities of their projects and are pushing the technical boundaries of stream processing further.
zh_cn: 这样，开源社区不断增强它们项目的功能并在流处理领域开疆拓土。

source: This way, the time to prepare a sin‐ gle beverage will increase, causing each person to spend more time in the coffee shop, thus lowering the overall throughput.
zh_cn: 这样的话，准备单杯咖啡的时间就会延长，继而导致每名顾客在店里花费的时间增加，整体吞吐量下降。
